#include<iostream>
using namespace std;


int main6()
{   //1 整型 其他类似
	int a = 0;
	cout << "请给整型变量a赋值" << endl;
	cin >> a;
	cout << "整型变量a = " << a << endl;
	// 加减乘除
	int a1 = 10;
	int b1 = 3 ;
	cout << a1 / b1 << endl; //int 把所有小数都去掉，两个整数相除，结果依然是整数
	//除数不可以为零，报错
	//取模运算本质  就是求余数 %   10%20=10 两个小数不可以做取模运算
	
	//1前置递增
	int a2 = 10;
	++a2;//让变量+1
	cout << a2 << endl;
	//2后置递增
	int b2 = 10;
		b2++;//让变量加1
		cout << "b2 =" << b2 << endl;

	//3、前置递增和后置递增的区别
	//前置递增 先让变量加1 ，然后进行表达式运算
	//后置递增 先进入表达式运算，后让变量+1//变量加1并不会影响表达式的运算.
		int a3 = 10; 
		int b3 = ++a3 * 10;
		cout <<" b3 = "<< b3 << endl;
		cout << "a3 = " << a3 << endl;
		int a4 = 10;
		int b4 = a4++ * 10;
		cout << "b4 =" << b4 << endl;
		cout << "a4 =" << a4 << endl;
		//前置递减 后置递减同理
		//赋值运算符 += -= *= /=
		//a = 10; a += 2;//a = a + 2
		//比较运算符 == != <=
		//(a==b)加括号比后面的<<endl先运算
		//逻辑运算符 !非 &&与  ||或

	//程序流程结构；顺序、选择、循环。
	  //选择 1单行格式if语句
		//用户输入分数，如果分数大于600，则视为考上一本大学，在屏幕上输出

		//1、用户输入分数
		int score = 0;
		cout << "请输入一个分数：" << endl;
		cin >> score;
		//2、打印用户输入的分数
		cout << "您输入的分数：" << score << endl;
		//3、判断分数是否大于600，如果大于，那么输出
		//注意事项，if条件后面不要加分号，要不然分离了，与前面分离。
		if (score > 600)
		{
			cout << "恭喜您考上了一本大学" << endl;
		}
		//多行格式if语句
		//语法 if（条件）{条件满足执行的语句}else{条件不满足执行的语句}；
		//用户输入分数，如果分数大于600，则视为考上一本大学，在屏幕上输出,如果没。。。
		int score2 = 0;
		cout << "请输入一个分数：" << endl;
		cin >> score2;
		cout << "您输入的分数：" << score2 << endl;
		if (score2 > 600)
		{
			cout << "恭喜您考上了一本大学" << endl;
		}
		else
		{
			cout << "你完了" << endl;
		}
		//多条件的if语句
	   //if(条件1){条件1满足执行的语句}else if（条件2）{条件2满足执行的语句}...else{都不满足执行的语句}
	 //用户输入分数，如果分数大于600，则视为考上一本大学，在屏幕上输出
	//大于500，视为考上二本大学，屏幕输出
   //大于400，视为考上三本大学。
  //小于等于400视为未考上本科，屏幕上输出
		int score3 = 0;
		cout << "请输入考试分数" << endl;
		cin >> score3;
		cout << "您输入的分数：" << score3 << endl;
		if (score3 > 600 )
		{
			cout << "恭喜您考上了一本大学" << endl;
			if (score3 > 700)
			{
				cout << "恭喜您考上了北京大学" << endl;
			}
			else if (score3 > 650)
			{
				cout << "恭喜您考上了清华大学" << endl;
			}
			else
			{
				cout << "恭喜您考上了人民大学" << endl;
			}
		}
           else if (score3 > 500)
		{
			cout << "恭喜您考上了二本大学" << endl;
		}
		   else if (score3 > 400)
		{
			cout << "恭喜您考上了三本大学" << endl;
		}
		   else {
			cout << "未考上本科大学，你完了" << endl;
		}
		/*if嵌套语句  将项目分层，层层分解
		*/



	system("pause");

	return 0;
}